In [19]:
import pandas as pd
from cassandra.cluster import Cluster

In [20]:
clstr = Cluster()
session = clstr.connect()

In [21]:
session.execute("DROP KEYSPACE IF EXISTS STU")

In [22]:
rows = session.execute("desc keyspaces")
for row in rows:
    print(f"{row[0]}")

bd23
system
system_auth
system_distributed
system_schema
system_traces
system_views
system_virtual_schema

In [23]:
session.execute("""
    CREATE KEYSPACE IF NOT EXISTS STU WITH REPLICATION = {
        'class':'SimpleStrategy', 
        'replication_factor':3
    }
""")

In [24]:
rows = session.execute("desc keyspaces")
for row in rows:
    print(f"{row[0]}")

bd23
stu
system
system_auth
system_distributed
system_schema
system_traces
system_views
system_virtual_schema

In [25]:
session.execute("""
CREATE TABLE IF NOT EXISTS STU.student ( 
    rollnum INT, 
    stuname TEXT, 
    branch TEXT, 
    mark INT, 
    PRIMARY KEY(rollnum)
);
""")

In [26]:
df = pd.read_csv('student.csv')
df

   rollnum    stuname         branch  mark
0        1   'Aarsha'     'computer'    70
1        2    'Alaka'     'computer'    60
2        3  'Anusree'  'electronics'    50
3        4     'Amal'        'civil'    89

In [27]:
for index, row in df.iterrows():
    print(f"rollnum = {row.rollnum}, stuname ={row.stuname}, branch = {row.branch}, mark = {row.mark}")

rollnum = 1, stuname ='Aarsha', branch = 'computer', mark = 70
rollnum = 2, stuname ='Alaka', branch = 'computer', mark = 60
rollnum = 3, stuname ='Anusree', branch = 'electronics', mark = 50
rollnum = 4, stuname ='Amal', branch = 'civil', mark = 89

In [28]:
for index, row in df.iterrows():
    print(f"""
        INSERT INTO STU.student (rollnum, stuname, branch, mark)     
        VALUES ({row.rollnum}, {row.stuname}, {row.branch}, {row.mark});
        """
    )
    session.execute(f"""
        INSERT INTO STU.student (rollnum, stuname, branch, mark)     
        VALUES ({row.rollnum}, {row.stuname}, {row.branch}, {row.mark});
        """
    )

        INSERT INTO STU.student (rollnum, stuname, branch, mark)
        VALUES (1, 'Aarsha', 'computer', 70);


        INSERT INTO STU.student (rollnum, stuname, branch, mark)
        VALUES (2, 'Alaka', 'computer', 60);


        INSERT INTO STU.student (rollnum, stuname, branch, mark)
        VALUES (3, 'Anusree', 'electronics', 50);


        INSERT INTO STU.student (rollnum, stuname, branch, mark)
        VALUES (4, 'Amal', 'civil', 89);

In [29]:
rows = session.execute("select (rollnum, stuname, branch, mark) from STU.student")
for row in rows:
    print(f"rollnum={row[0][0]}, stuname={row[0][1]}, branch={row[0][2]}, mark={row[0][3]}")

rollnum=1, stuname=Aarsha, branch=computer, mark=70
rollnum=2, stuname=Alaka, branch=computer, mark=60
rollnum=4, stuname=Amal, branch=civil, mark=89
rollnum=3, stuname=Anusree, branch=electronics, mark=50

In [30]:
rows = session.execute("select (rollnum, stuname, branch, mark) from STU.student where branch='computer' ALLOW FILTERING")
for row in rows:
    print(f"rollnum={row[0][0]}, stuname={row[0][1]}, branch={row[0][2]}, mark={row[0][3]}")

rollnum=1, stuname=Aarsha, branch=computer, mark=70
rollnum=2, stuname=Alaka, branch=computer, mark=60

In [31]:
rows = session.execute("select (rollnum, stuname, branch, mark) from STU.student where mark > 60 ALLOW FILTERING")
for row in rows:
    print(f"rollnum={row[0][0]}, stuname={row[0][1]}, branch={row[0][2]}, mark={row[0][3]}")

rollnum=1, stuname=Aarsha, branch=computer, mark=70
rollnum=4, stuname=Amal, branch=civil, mark=89

In [37]:
rows = session.execute("select (rollnum, stuname, branch, mark) from STU.student where mark>50 and mark <70 ALLOW FILTERING")
for row in rows:
    print(f"rollnum={row[0][0]}, stuname={row[0][1]}, branch={row[0][2]}, mark={row[0][3]}")

rollnum=2, stuname=Alaka, branch=computer, mark=60